SimulationDatabase/NearSonicJet/Template/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "5000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.432 0 0);

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            pressureInletVelocity;
        value           nonuniform List<vector> 
24
(
(23.018057 -0 0.0073641678)
(23.022633 2.9415135e-17 0.0078662679)
(23.026367 -8.6298017e-18 0.0075813882)
(23.026314 1.2112265e-17 0.007769335)
(22.997415 -0 0.007680807)
(22.929029 -0 0.0076170503)
(22.790938 -8.1894689e-18 0.007610471)
(22.546084 -0 0.0075224356)
...
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            slip;
    }
    inflow1
    {
        type            fixedValue;
        value           uniform (3.432 0 0);
    }
    wall2
    {
        type            slip;
    }
    inflow2
    {
        type            fixedValue;
        value           uniform (3.432 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    wall3
    {
        type            slip;
    }
}


// ************************************************************************* //
