SimulationDatabase/NearSonicJet/Template/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1e-06;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            kqRWallFunction;
        value           uniform 1e-06;
    }
    inflow1
    {
        type            fixedValue;
        value           uniform 1e-06;
    }
    wall2
    {
        type            kqRWallFunction;
        value           uniform 1e-06;
    }
    inflow2
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall3
    {
        type            kqRWallFunction;
        value           uniform 1e-06;
    }
}


// ************************************************************************* //
