SimulationDatabase/NearSonicJet/Template/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture // air at room temperature (293 K)
{
    specie
    {
        molWeight   28.9;
    }
    thermodynamics
    {
        Cp          1005;
        Hf          0;
    }
    transport
    {
        mu          1.82e-05;
        Pr          0.71;
    }
}



/*mixture // air at 27°C (300 K)*/
/*{*/
/*    specie*/
/*    {*/
/*        molWeight   28.9;*/
/*    }*/
/*    thermodynamics*/
/*    {*/
/*        Cp          1007;          // specific heat capacity at 300K*/
/*        Hf          0;*/
/*    }*/
/*    transport*/
/*    {*/
/*        mu          1.85e-05;      // dynamic viscosity at 300K*/
/*        Pr          0.71;          // Prandtl number*/
/*    }*/
/*}*/



/*mixture // air at room temperature (293 K)*/
/*{*/
/*    specie*/
/*    {*/
/*        molWeight   28.97;  // ✅ Correct molecular weight for air*/
/*    }*/
/*    thermodynamics*/
/*    {*/
/*        Cp          1005;    // ✅ Correct specific heat at constant pressure (J/kg·K)*/
/*        Hf          0;*/
/*    }*/
/*    transport*/
/*    {*/
/*        mu          1.82e-5;*/
/*        Pr          0.71;*/
/*    }*/
/*}*/



// ************************************************************************* //
