SimulationDatabase/NearSonicJet/Template/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{

	RASModel        kOmegaSSTInternalBlend_NP;
    
        turbulence      on;

        printCoeffs     on;

	omegaInf        1e-8;
	
	numInvar        2;
	
	degreeP        4; // The polynomial in invariants I1 and I2 is of order 4
	
	lambdaMax        3;

	h_max_active_terms	1;
	
	UseExactbDelta	false;
