SimulationDatabase/NearSonicJet/Template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("libmyCompressibleTurbulenceModels.so");

application     rhoSimpleFoamFeatures;

startFrom       latestTime;//startTime;startTime;//

startTime       0;

stopAt          endTime;

endTime         5000;//0.1;

deltaT          1;//5e-7;

writeControl    adjustableRunTime;

writeInterval   500;//300;//0.001;

purgeWrite      2;

writeFormat     ascii;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

maxCo         5;

adjustTimeStep  no;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*functions*/
/*{*/
/*    #includeFunc "stressComponents"*/
/*    #includeFunc "pressureCoefficient"*/
/*    #includeFunc "sample"*/
/*    #includeFunc "sampleCp"*/
/*    #includeFunc "writeCellCentres"*/
/*    #includeFunc "wallShearStress"*/
/*}*/





