SimulationDatabase/NearSonicJet/Template/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


type            sets;
libs            (sampling);

writeControl    onEnd;

interpolationScheme cellPoint;

setFormat       raw;

fields          (k k_Frozen U U_Frozen turbulenceProperties:devReff bijDelta bijDeltaFrozen p);

sets
{
    Uref
    {
        type    cloud;
        axis    z;
        points  ((1. 0 1.));
    }

    x_by_h_0.1
    {
        type    face;
        axis    z;
        start   (0.1 0 0);
        end     (0.1 0 1.2);
        nPoints 100;
    }
    
    x_by_h_0.2
    {
        type    face;
        axis    z;
        start   (0.2 0 0);
        end     (0.2 0 1.2);
        nPoints 100;
    }
    
    x_by_h_0.3
    {
        type    face;
        axis    z;
        start   (0.3 0 0);
        end     (0.3 0 1.2);
        nPoints 100;
    }
    
    x_by_h_0.4
    {
        type    face;
        axis    z;
        start   (0.4 0 0);
        end     (0.4 0 1.2);
        nPoints 100;
    }
    
    
    x_by_h_0.5
    {
        type    face;
        axis    z;
        start   (0.5 0 0);
        end     (0.5 0 1.2);
        nPoints 100;
    }
    x_by_h_0.6
    {
        type    face;
        axis    z;
        start   (0.6 0 0);
        end     (0.6 0 1.2);
        nPoints 100;
    }
    
    x_by_h_0.7
    {
        type    face;
        axis    z;
        start   (0.7 0 0);
        end     (0.7 0 1.2);
        nPoints 100;
    }
    
    x_by_h_0.8
    {
        type    face;
        axis    z;
        start   (0.8 0 0);
        end     (0.8 0 1.2);
        nPoints 100;
    }
    
    x_by_h_0.9
    {
        type    face;
        axis    z;
        start   (0.9 0 0);
        end     (0.9 0 1.2);
        nPoints 100;
    }
    
    x_by_h_1
    {
        type    face;
        axis    z;
        start   (1 0 0);
        end     (1 0 1.2);
        nPoints 100;
    }
    
    x_by_h_1.1
    {
        type    face;
        axis    z;
        start   (1.1 0 0);
        end     (1.1 0 1.2);
        nPoints 100;
    }
    
    vel_jet_axis
    {
        type    face;
        axis    x;
        start   (0. 1e-10 1e-6);
        end     (2. 1e-10 1e-6);
        nPoints 100;
    }
    
}


// ************************************************************************* //
